app/Controllers/Dashboard.php

    public function index()
    {
        $data['total_users'] = $this->userModel->countAll();
        $data['total_presensi'] = $this->presensiModel->countAll();
        $data['presensi_hari_ini'] = $this->presensiModel->where('tanggal', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `tb_user`
SELECT COUNT(*) AS `numrows` FROM `tb_presensi`
SELECT COUNT(*) AS `numrows`
FROM `tb_presensi`
WHERE `tanggal` = '2025-05-23'