app/Controllers/JadwalShift.php

SELECT *
FROM `tb_jadwal_shift`
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` = '1'
---
    public function index()
    {
        $data['jadwal_shift'] = $this->jadwalShiftModel->findAll();
        // Get users for each jadwal shift
        foreach ($data['jadwal_shift'] as &$shift) {
            $shift['users'] = $this->userModel->where('id_jadwal_shift', $shift['id_jadwal_shift'])->findAll();

INSERT INTO `tb_jadwal_shift` (`dari_tanggal`, `sampai_tanggal`, `shift_mulai`, `shift_selesai`, `jenis_shift`) VALUES ('2025-05-01', '2025-05-31', '07:07', '13:01', 'pagi')
UPDATE `tb_user` SET `id_jadwal_shift` = 1
WHERE `iduser` IN ('6')
---
    public function store()
    {
        $data = [
            'dari_tanggal' => $this->request->getPost('dari_tanggal'),
            'sampai_tanggal' => $this->request->getPost('sampai_tanggal'),
            'shift_mulai' => $this->request->getPost('shift_mulai'),
            'shift_selesai' => $this->request->getPost('shift_selesai'),
            'jenis_shift' => $this->request->getPost('jenis_shift'),
        ];

        $this->db->transStart();

        // Insert jadwal shift
        $id_jadwal_shift = $this->jadwalShiftModel->insert($data);

        // Update selected users
        $selected_users = $this->request->getPost('users');
        if ($selected_users) {
            $this->userModel->whereIn('iduser', $selected_users)
                ->set(['id_jadwal_shift' => $id_jadwal_shift])
                ->update();

SELECT *
FROM `tb_jadwal_shift`
WHERE `tb_jadwal_shift`.`id_jadwal_shift` = '1'
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` = '1'
SELECT *
FROM `tb_user`
WHERE `id_jadwal_shift` IS NULL
---
    public function edit($id)
    {
        $data['jadwal_shift'] = $this->jadwalShiftModel->find($id);
        // Get users assigned to this shift
        $data['assigned_users'] = $this->userModel->where('id_jadwal_shift', $id)->findAll();
        // Get users not assigned to any shift
        $data['available_users'] = $this->userModel->where('id_jadwal_shift IS NULL')->findAll();

UPDATE `tb_jadwal_shift` SET `dari_tanggal` = '2025-05-01', `sampai_tanggal` = '2025-05-31', `shift_mulai` = '07:07:00', `shift_selesai` = '13:00', `jenis_shift` = 'pagi'
WHERE `tb_jadwal_shift`.`id_jadwal_shift` IN ('1')
UPDATE `tb_user` SET `id_jadwal_shift` = NULL
WHERE `id_jadwal_shift` = '1'
UPDATE `tb_user` SET `id_jadwal_shift` = '1'
WHERE `iduser` IN ('6')
---
    public function update($id)
    {
        $data = [
            'dari_tanggal' => $this->request->getPost('dari_tanggal'),
            'sampai_tanggal' => $this->request->getPost('sampai_tanggal'),
            'shift_mulai' => $this->request->getPost('shift_mulai'),
            'shift_selesai' => $this->request->getPost('shift_selesai'),
            'jenis_shift' => $this->request->getPost('jenis_shift'),
        ];

        $this->db->transStart();

        // Update jadwal shift
        $this->jadwalShiftModel->update($id, $data);

        // Reset all users from this shift
        $this->userModel->where('id_jadwal_shift', $id)
            ->set(['id_jadwal_shift' => null])
            ->update();

        // Update selected users
        $selected_users = $this->request->getPost('users');
        if ($selected_users) {
            $this->userModel->whereIn('iduser', $selected_users)
                ->set(['id_jadwal_shift' => $id])
                ->update();