app/Controllers/Presensi.php

SELECT *
FROM `tb_user`
WHERE `id_kartu_rfid` IS NULL
 LIMIT 1
---
    public function scanRfid()
    {
        $rfid = $this->request->getPost('rfid');

        // Debug untuk melihat RFID yang diterima
        log_message('debug', 'RFID yang diterima: ' . $rfid);

        $user = $this->userModel->where('id_kartu_rfid', $rfid)->first();

SELECT *
FROM `tb_jadwal_shift`
WHERE `tb_jadwal_shift`.`id_jadwal_shift` = '2'
---
        }

        // Cek jadwal shift
        $jadwalShift = $this->jadwalShiftModel->find($user['id_jadwal_shift']);

SELECT *
FROM `tb_presensi`
WHERE `tanggal` = '2025-06-04'
AND `tb_user_iduser` = '12'
 LIMIT 1
---

        // Cek apakah user sudah absen hari ini
        $today = date('Y-m-d');
        $existingPresensi = $this->presensiModel->where([
            'tb_user_iduser' => $user['iduser'],
            'tanggal' => $today
        ])->first();