app/Controllers/Presensi.php

SELECT *
FROM `tb_user`
WHERE `id_kartu_rfid` = '0002449499'
 LIMIT 1
---
    public function scanRfid()
    {
        $rfid = $this->request->getPost('rfid');

        // Cari user berdasarkan id_kartu_rfid
        $user = $this->userModel->where('id_kartu_rfid', $rfid)->first();

        if (!$user) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Kartu tidak terdaftar'
            ]);
        }

        // Cek apakah user memiliki jadwal shift
        if (!$user['id_jadwal_shift']) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'User tidak memiliki jadwal shift'
            ]);
        }

        // Ambil jadwal shift user
        $jadwalShift = $this->jadwalShiftModel->find($user['id_jadwal_shift']);