app/Controllers/Presensi.php

    public function publicScanRfid()
    {
        // Terima data RFID dari request sebagai string
        $rfid = $this->request->getJSON()->rfid;

        // Debug untuk melihat RFID yang diterima
        log_message('debug', 'RFID yang diterima: ' . $rfid);

        // Cari user berdasarkan RFID (sebagai string)
        $user = $this->userModel->where('id_kartu_rfid', $rfid)->first();

        if (!$user) {
            log_message('error', 'User tidak ditemukan untuk RFID: ' . $rfid);
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Kartu RFID tidak terdaftar'
            ]);
        }

        // Cek jadwal shift user
        if (!isset($user['id_jadwal_shift']) || empty($user['id_jadwal_shift'])) {
            log_message('error', 'User ' . $user['nama'] . ' belum memiliki jadwal shift');
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'User belum memiliki jadwal shift'
            ]);
        }

        // Ambil jadwal shift
        $jadwalShift = $this->jadwalShiftModel->find($user['id_jadwal_shift']);
---
SELECT *
FROM `tb_user`
WHERE `id_kartu_rfid` = '0003041901'
 LIMIT 1
SELECT *
FROM `tb_jadwal_shift`
WHERE `tb_jadwal_shift`.`id_jadwal_shift` = '1'

        }

        // Cek cooldown untuk RFID yang sama (5 detik)
        $lastScan = $this->presensiModel->where('tb_user_iduser', $user['iduser'])
            ->orderBy('dibuat_pada', 'DESC')
            ->first();
---
SELECT *
FROM `tb_presensi`
WHERE `tb_user_iduser` = '2'
ORDER BY `dibuat_pada` DESC
 LIMIT 1