app/Controllers/Users.php

    public function index()
    {
        $data['users'] = $this->userModel->where('role', 'karyawan')->findAll();
---
SELECT *
FROM `tb_user`
WHERE `role` = 'karyawan'

    public function store()
    {
        $rules = [
            'nama' => 'required|min_length[3]',
            'id_kartu_rfid' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Get nama and generate email from first name
        $nama = $this->request->getPost('nama');
        $namaParts = explode(' ', $nama);
        $firstName = strtolower($namaParts[0]);

        $data = [
            'nama' => $nama,
            'role' => 'karyawan',
            'id_kartu_rfid' => $this->request->getPost('id_kartu_rfid'),
            'email' => $firstName . '@sinamedika.com',
            'password' => md5('karyawan123'),
            'status' => 'aktif',
            'gender' => $this->request->getPost('gender')
        ];

        $this->userModel->insert($data);
---
INSERT INTO `tb_user` (`nama`, `role`, `id_kartu_rfid`, `email`, `password`, `status`, `gender`) VALUES ('jaja', 'karyawan', '2449499', 'jaja@sinamedika.com', '07142c5501c3ea09303d899012e2b47d', 'aktif', 'perempuan')

    public function update($id)
    {
        $user = $this->userModel->find($id);
        if (!$user) {
            return redirect()->to('/users')->with('error', 'Karyawan tidak ditemukan');
        }

        $rules = [
            'nama' => 'required|min_length[3]',
            'id_kartu_rfid' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Get nama and generate email from first name
        $nama = $this->request->getPost('nama');
        $namaParts = explode(' ', $nama);
        $firstName = strtolower($namaParts[0]);

        $data = [
            'nama' => $nama,
            'id_kartu_rfid' => $this->request->getPost('id_kartu_rfid'),
            'email' => $firstName . '@sinamedika.com',
            'status' => $this->request->getPost('status'),
            'gender' => $this->request->getPost('gender')
        ];

        $this->userModel->update($id, $data);
---
UPDATE `tb_user` SET `nama` = 'Ferry', `id_kartu_rfid` = '0002449499', `email` = 'ferry@sinamedika.com', `status` = 'aktif', `gender` = 'laki-laki'
WHERE `tb_user`.`iduser` IN ('12')