app/Models/PresensiModel.php

    public function getPresensiWithUser()
    {
        return $this->select('tb_presensi.*, tb_user.nama, tb_jadwal_shift.jenis_shift')
            ->join('tb_user', 'tb_user.iduser = tb_presensi.tb_user_iduser')
            ->join('tb_jadwal_shift', 'tb_jadwal_shift.id_jadwal_shift = tb_presensi.tb_jadwal_shift_id_jadwal_shift')
            ->findAll();
---
SELECT `tb_presensi`.*, `tb_user`.`nama`, `tb_jadwal_shift`.`jenis_shift`
FROM `tb_presensi`
JOIN `tb_user` ON `tb_user`.`iduser` = `tb_presensi`.`tb_user_iduser`
JOIN `tb_jadwal_shift` ON `tb_jadwal_shift`.`id_jadwal_shift` = `tb_presensi`.`tb_jadwal_shift_id_jadwal_shift`